//try
//{
//    const int MNOZH = 56;
//    Console.Write("Введите первую переменную:");
//    double a = double.Parse(Console.ReadLine().Trim());
//    Console.Write("Введите вторую переменную:");
//    int b = Convert.ToInt32(Console.ReadLine());
//    double S = (a + b)*MNOZH;
//    Console.WriteLine($"({a}+{b})*{MNOZH}={S}");
//}
//catch
//{
//    Console.WriteLine("Правильно введите переменные!");
//}

//byte a = 56;
//sbyte sa=-45;

//short b = 189;
//ushort ub = 54353;

//int c = 34324;
//uint uc = 54435353;

//long d = 234234233454;
//ulong ud = 2342342342342;

//float e = 443.8f;
//double f = 434.87;

//decimal money = 545.65m;

//sbyte x = (sbyte)b;
//Console.WriteLine(b+" "+x);

//Вывести на экран число с точностью до сотых.
//Console.WriteLine($"{Math.PI:F2}");
//Вывести на экран число e (основание натурального логарифма) с точностью до десятых.
//Console.WriteLine($"{Math.E:F1}");
//Составить программу вывода на экран числа, вводимого с клавиатуры. Выво-димому числу должно предшествовать сообщение "Вы ввели число".
//try
//{
//    Console.Write("Введите число:");
//    double a = double.Parse(Console.ReadLine());
//    Console.WriteLine($"Вы ввели число:{a}");
//}
//catch
//{
//    Console.WriteLine("Введите число правильно!");
//}
//Вывести на одной строке числа 1, 13 и 49 с одним пробелом между ними.
//Console.WriteLine($"{1} {13} {49}");
//Вывести на одной строке числа 7, 15 и 100 с двумя пробелами между ними.
//int a = 7, b = 15, c = 100;
//Console.WriteLine($"{a}{b,4}{c,5}");
//Вывести на экран числа 50 и 10 одно под другим.
//Console.WriteLine(50);
//Console.WriteLine(10);
//Вывести на экран числа 5, 10 и 21 одно под другим.
//Console.WriteLine($"{50}\n{10}\n{21}");
//Составить программу вывода на экран следующей информации:а)
//5 10
//7 см
//Console.WriteLine($"{5} {10}\n{7} см");
//2x
try
{
    // Console.Write("Введите x:");
    // double x = double.Parse(Console.ReadLine());
    // double y = 2 * x;
    //double y = Math.Sin(x*Math.PI/180);
    //double y = x * x;
    //double y =Math.Sqrt(x);
    //double y = Math.Abs(x);
    //double y = 5 * Math.Cos(x*Math.PI/180);
    //Console.Write("Введите m:");
    //double m= double.Parse(Console.ReadLine());
    //Console.Write("Введите n:");
    //double n = double.Parse(Console.ReadLine());
    //double y = Math.Pow(2, Math.Pow(m, n));
    //Console.WriteLine($"y={y:F2}");
    //Console.Write("Введите a:");
    //double a = double.Parse(Console.ReadLine());
    //Console.Write("Введите b:");
    //double b = double.Parse(Console.ReadLine());
    //Console.Write("Введите c:");
    //double c = double.Parse(Console.ReadLine());
    //double y = (-b + Math.Sqrt(b * b - 4 * a * c)) / (2 * a);
    //Console.WriteLine($"y={y:F2}");
    
   
}
catch
{
    Console.WriteLine("Введите правильно");
}